# PathCurveReference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..PathCurveReference Property
Form Class See Also
---
The curve reference in the path, specified by curve index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference this[
	int curveIndex
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathCurveReference ( _
	curveIndex As Integer _
) As Reference
	Get
```

Visual C++
---
```text
public:
property Reference^ PathCurveReference[int curveIndex] {
	Reference^ get (int curveIndex);
}
```

# ### Parameters
curveIndex
    Type: System..::..Int32Index to specify the curve in path
# See Also
Form Class
Autodesk.Revit.DB Namespace